docs/state_machines/dot/en/global/state_Announcement.dot
digraph {
  rankdir=LR;
  node [shape=oval];
  edge [fontsize=10];

  pending [label="created"];
  delivered [label="delivered"];
  __initial [shape=point];
  __initial -> pending;
  pending -> delivered [label="deliver"];
}
