docs/state_machines/mmd/en/global/state_Announcement.mmd
stateDiagram-v2
  direction LR

  state "created" as pending
  state "delivered" as delivered

  [*] --> pending
  pending --> delivered : deliver
